<a href="https://colab.research.google.com/github/C4k3-178/PrIS_02/blob/main/%D0%97%D0%B0%D0%B4%D0%B0%D0%BD%D0%B8%D0%B5.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# import packages

In [23]:
import pandas as pd
import numpy as np
from IPython.display import display

# import data

In [10]:
data = pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/glass/glass.data", header=None)
data.head (3)

   0        1      2     3     4      5     6     7    8    9   10
0   1  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0   1
1   2  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0   1
2   3  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0   1

In [11]:
names = ["Id","RI", "Na", "Mg", "Al", "Si", "K", "Ca", "Ba", "Fe", "Glass"]
data.columns = names
data = data.drop (columns=("Id"))
data.head(3)

        RI     Na    Mg    Al     Si     K    Ca   Ba   Fe  Glass
0  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0      1
1  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0      1
2  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0      1

In [33]:
data ['Class'].replace({1:"Building_float",
                       2: "building_windows_non_float",
                       3: "vehicle_windows_float",
                       4: "vehicle_windows_non_float",
                       5: "containers",
                       6: "tableware",
                       7: "headlamps"}, inplace=True)

data ("Class").value_counts()

TypeError: ignored

In [25]:
for col in data.columns:
  fr = np.random.randint(5,10)/100
  data.loc[data.sample(frac=fr).index, col] = np.nan

#Data Vizualization

In [31]:
data.describe ()

               RI          Na          Mg  ...          Ba          Fe       Glass
count  201.000000  199.000000  199.000000  ...  201.000000  195.000000  199.000000
mean     1.518412   13.400653    2.692462  ...    0.179701    0.055128    2.763819
std      0.003107    0.824824    1.429290  ...    0.510390    0.092738    2.091227
min      1.511150   10.730000    0.000000  ...    0.000000    0.000000    1.000000
25%      1.516530   12.895000    2.145000  ...    0.000000    0.000000    1.000000
50%      1.517680   13.310000    3.480000  ...    0.000000    0.000000    2.000000
75%      1.519260   13.820000    3.595000  ...    0.000000    0.095000    3.000000
max      1.533930   17.380000    4.490000  ...    3.150000    0.370000    7.000000

[8 rows x 10 columns]